---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.GraphicDisplayOptionsLighting
source: html/c3606a52-f739-3c2f-c5be-22419c9be110.htm
---
# Autodesk.Revit.DB.ParameterTypeId.GraphicDisplayOptionsLighting Property

"Lighting"

## Syntax (C#)
```csharp
public static ForgeTypeId GraphicDisplayOptionsLighting { get; }
```